
# დავალება 1
# დაწერეთ პროგრამა რომელიც კითხულობს სამ მთელ რიცხვს და ეკრანზე(ტერმინალში) გამოაქვს მათი ჯამი.
x=8
y=17
z=25
print(x+y+z)
# დავალება 2
# დაწერეთ პროგრამა, რომელიც გარდაქმნის ტემპერატურას ცელსიუსიდან ფარენჰეიტში.
# გამოიყენეთ ცვლადი ცელსიუსის ტემპერატურის შესანახად, 
# შეასრულეთ კონვერტაცია ფორმულის გამოყენებით (ცელსიუსი * 9/5) + 32 და დაბეჭდეთ შედეგი.
a=45
print(a*9/4+32)
# დავალება 3
# დაწერეთ პითონის პროგრამა, რომელიც იღებს მომხმარებლისგან კუბის გვერდის სიგრძეს 
# და ითვლის კუბის ზედაპირის ფართობსაც და მოცულობასაც და შემდეგ ამობეჭდავს ფართობსაც და მოცულობასაც.
k=int(input("შემოიყვანეთ კუბის განზომილება: "))
print(6*k**2)
print(k**3)
