
#1. დაწერეთ პითონის პროგრამა, რომელიც ცვლის tuple-ის ბოლო მნიშვნელობას სიაში.
# ნიმუშების სია: [(10, 20, 40), (40, 50, 60), (70, 80, 90)]

a=[(10, 20, 40), (40, 50, 60), (70, 80, 90)]
b=[] 
c=[] 
for i in range(len(a)):
    b.append(list(a[i]))
    b[i][2] = b[i][2]*1.2 # b-ში ვწერ ლისტად გადაქცეულ ტაპლებს, რომლის ბოლო ელემენტებსაც ვზრდი 20 %-ით.
    c.append(tuple(b[i])) # b-ში ვწერ ტაპლად გადაქცეულ შეცვლილ ლისტებს.
print(a)
print(b)
print(c)

# 2.max და min ფუნქციის გარეშე იპოვეთ სეტში არსებული უმცირესი და უდიდესი მონაცემი.

x=[2,12,56,34,5,8,3,8,4,3,7,7]
y = set(x)
z = sorted(y)
m = list(z)
min_x = m[0]
max_x = m[len(m)-1]
print(x)
print(z)
print(min_x)
print(max_x)

# 3.დაწერეთ პითონის პროგრამა, რათა გამოვთვალოთ რიცხვების საშუალო მნიშვნელობა მოცემულ ტოპებში.
# Input = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4))

# Output = [10.5, 44.0, 58.0, 2.5]

Input = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4))
input_list = list(Input)
print(input_list)
output =[]
for i in range(len(input_list)):
    p=(sum(list(input_list[i]))) / len(input_list[i])
    output.append(p)
print(output)

