
# გაითვალისწინეთ owner-ის მნიშვნელობა არის Person კლასის ობიექტი
# შექმენით ორი Person კლასის ობიექტი(მაგალითად ერთი მეპატრონე, მეორე მყიდველი). 
# ასევე შექმენით House კლასის ობიექტი რომლის owner იქნება ერთ-ერთი Person ობიექტი
# House კლასში დაამატეთ ბინის გაყიდვის მეთოდი, რომლის დროსაც პარამეტრებად გადაეცემა მყიდველი, 
# თუ მეტი პარამეტრი არ გადაეცემა, 
# ამ დროს უნდა შესრულდეს ბინის გაყიდვის ოპერაცია
# (გამყიდველის deposit უნდა გაიზარდოს ბინის ღირებულებით,
# უნდა შეიცვალოს owner და status უნდა გახდეს “გაყიდული”, დაბეჭდეთ შესაბამისი ტექსტი).
# თუ ამ მეთოდის გამოძახების დროს მყიდველის გარდა პარამეტრად გადაეცა კიდევ ერთი რიცხვი,
# მაშინ შესრულდეს ბინის სესხით გაყიდვის ოპერაცია, 
# სადაც პარამეტრად გადაცემული რიცხვი მიუთითებს მყიდველის მიერ აღებული სესხის რაოდენობას,
# მეთოდმა კი უნდა შეასრულოს შემდეგი ოპერაციები: 
# გამყიდველის deposit უნდა გაიზარდოს ბინის ღირებულებით,
# owner უნდა შეიცვალოს, status გახდეს “გაყიდული სესხით”,
# მყიდველის სესხი (loan) უნდა გაიზარდოს შესაბამისი რაოდენობით 
# და დაიბეჭდოს გაყიდვის შესაბამისი შეტყობინება.
# კლასის გარეთ მოახდინეთ აღწერილი ფუნქციების გამოძახება
# შენიშვნა: 
# რადგან ბევრი დავალება დამიგროვდა უფრო ნაკლები მოთხოვნები დავაკმაყოფილე მერე მივხედავ ამ საქმეს

class Person:
  def __init__(self,owner_name,owner_account,owner_price,buyer_name,buyer_deposit,bank_supplement):
        self.owner_name = owner_name
        self.owner_account = owner_account
        self.owner_price = owner_price
        self.buyer_name = buyer_name
        self.buyer_deposit = buyer_deposit
        self.bank_supplement = bank_supplement 
  def house(self):
        if self.buyer_deposit >= self.owner_price*(1+self.bank_supplement):
            print(f"ბინის ძველი მფლობელია: {self.owner_name}")
            print(f"ბინის ძველი მფლობელის ანგარიშის ნომერია: {self.owner_account}") 
            print(f"ბინა შეფასებული იყო: {self.owner_price} დოლარად") 
            print(f"ბინის შეძენის მსურველი იყო: {self.buyer_name}")   
            print(f"მყიდველის დეპოზიტზე არსებული თანხა იყო: {self.buyer_deposit} დოლარი")
            print(f"ბანკის მიერ დარიცხული პროცენტი იყო {self.bank_supplement*100} პროცენტი")
            print(f"მყიდველმა გადაიხადა მოთხოვნილი თანხა და ბინის ახალი მფლობელია {self.buyer_name}") 
        else:
            print(f"ბინის ძველი მფლობელია: {self.owner_name}")
            print(f"ბინის ძველი მფლობელის ანგარიშის ნომერია: {self.owner_account}") 
            print(f"ბინა შეფასებული იყო: {self.owner_price} დოლარად") 
            print(f"ბინის შეძენის მსურველი იყო: {self.buyer_name}")   
            print(f"მყიდველის დეპოზიტზე არსებული თანხა იყო: {self.buyer_deposit} დოლარი")
            print(f"ბანკის მიერ დარიცხული პროცენტი იყო {self.bank_supplement*100} პროცენტი")
            print(f"{self.buyer_name} დეპოზიტზე არსებული თანხა, არ აღმოჩნდა საკმარისი ბინის შესაძენად") 
            print(f"მყიდველმა ვერ გადაიხადა მოთხოვნილი თანხა და ბინის მფლობელია ისევ {self.owner_name}") 

person_1 = Person("სიმონა დოლიძე","TB123",135000,"ნიკო კვახაძე",180000,0.0002)
person_1.house()
print(" ")
person_2 = Person("ლაურა ხვედელიძე","TB78904",140000,"ნოდარ კვიჟინაძე",130020,0.0002)
person_2.house()